Revit 2027 API
BuiltInFailures.AutoRouteFailures.OverrideFabricationPartFailed Property
 The fabrication part cannot be overridden. The button code you specified does not match the fabrication service. Please specify a different button code or check the fabrication service and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OverrideFabricationPartFailed { get; }
Public Shared ReadOnly Property OverrideFabricationPartFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OverrideFabricationPartFailed {
	FailureDefinitionId^ get ();
}
static member OverrideFabricationPartFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace